import React from 'react';
import styles from './rule.module.css'
const AgreementIndex = () => {
  return (
    <div className={styles.container}>
      <h2 style={{textAlign:"center",padding:20}}>Пользовательское соглашение</h2>
      <p>
        1. Статус Пользовательского соглашения <br/>
        2. Настоящее Пользовательское соглашение является юридически обязательным соглашением между Посетителем,
        Пользователем и Компанией, предметом которого является предоставление Компанией Посетителю, Пользователю доступа
        к ознакомлению с Сайтом и возможность использовать функционал Сайта для совершения заказа Товаров после
        регистрации Пользователя на Сайте. <br/>
        3. Посетитель и Пользователь обязаны полностью ознакомиться с настоящим Пользовательским соглашением до момента
        использования Сайта. <br/>
        4. Посетитель, Пользователь принимают условия настоящего Пользовательского соглашения, в полном объеме и без
        каких-либо изъятий. <br/>
        5. В случае несогласия с перечисленными условиями Посетитель и Пользователь должны воздержаться от использования
        Сайта. <br/>
        6. Термины и определения <br/>
        7. В настоящем Пользовательском соглашении, если из контекста не следует иное, нижеприведенные термины с
        заглавной буквы имеют следующие значения: <br/>
        8. `Компания` - юридическое лицо или индивидуальный предприниматель, осуществляющий продажу Товаров, в том числе
        дистанционным способом через Сайт. В отношении настоящей редакции Пользовательского соглашения под `Компанией`
        следует понимать Алекс пицца. <br/>
        9. `Посетитель` - любое дееспособное лицо, желающее ознакомится с содержанием Сайта, или намеренное заказать или
        приобрести Товары Компании исключительно для личных, семейных, домашних или иных нужд, не связанных с
        осуществлением предпринимательской деятельности. <br/>
        10. `Пользователь` - Посетитель, который уже зарегистрирован на Сайте (имеет личную учетную запись).
        11. `Товары` - продукция Компании, представленная на Сайте. <br/>
        12. `Сайт` - страница Интернет-магазина, на которой размещен перечень продукции Компании, по следующему адресу:
        alekspizza.ru (в том числе мобильное приложение). <br/>
        13. Для целей настоящего Пользовательского соглашения термины и определения в единственном числе относятся также
        и к терминам и определениям во множественном числе и наоборот. <br/>
        14. Предмет Пользовательского Соглашения <br/>
        15. Предметом настоящего Пользовательского соглашения являются порядок и правила использования функционала
        (сервисов) Сайта, установленные Компанией для Посетителей и Пользователей Сайта. <br/>
        16. Компания гарантирует Пользователям возможность совершить заказ Товаров и его оплату через Сайт только в
        случае исправной работы всех коммуникационных сетей и не несет ответственности за неисполнение заказа Товаров в
        случае технических проблем на Сайте. <br/>
        17. Регистрация и предоставление услуг <br/>
        18. Для получения права оформить заказ Товаров через Сайт Пользователь обязуется осуществить регистрацию учетной
        записи Пользователя на Сайте. <br/>
        19. Для регистрации на Сайте Пользователю следует произвести следующие действия: <br/>
        20. ввести в форму абонентский номер телефона в федеральном формате (+ХХХХХХХХХХХ); <br/>
        21. указанный Пользователем при регистрации абонентский номер телефона будет использоваться в качестве имени
        Пользователя (логин) при использовании Сайта; <br/>
        22. ввести пароль, предоставляемый Пользователю в виде SMS-сообщения на указанный им абонентский номер; <br/>
        23. указать фамилию, имя, отчество; дату рождения; адрес доставки; телефон; адрес электронной почты; <br/>
        24. Регистрация будет считаться завершенной после корректного ввода Пользователем пароля, полученного им в
        SMS–сообщении. <br/>
        25. В случае несогласия с перечисленными условиями Пользователь должен воздержаться от использования сервисов
        Сайта. <br/>
        26. Пользователю запрещается передавать данные своей учетной записи третьим лицам. В случае передачи
        Пользователем своего логина и/или пароля третьему лицу, Пользователь несет ответственность за
        несанкционированные действия третьего лица, как за свои собственные. <br/>
        27. Пользователь несет ответственность за точность и правильность, полноту и достоверность указания своих личных
        данных при регистрации учетной записи на Сайте и за последствия в виде убытков, которые могут возникнуть у
        Пользователя, в случае некорректного ввода указанных сведений. <br/>
        28. Пользователь обязан незамедлительно уведомить Компанию о любом случае несанкционированного доступа к учетной
        записи Пользователя, а также о любом случае нарушения безопасности своего логина и пароля (утеря, передача
        данных третьим лицам, другое). <br/>
        29. Любые действия, совершенные на Сайте с использованием логина и пароля Пользователя, считаются совершенными
        соответствующим Пользователем. <br/>
        30. Пользователь несет личную ответственность за любую информацию, которая размещается на Сайте посредством его
        учетной записи. <br/>
        31. Условия использования информации, размещенной на Сайте <br/>
        32. Сайт включает, но не ограничивается, следующим: тексты, фотографии, графические изображения, товарные знаки
        и иные, охраняемые законом, материалы. <br/>
        33. Все содержание Сайта охраняется авторским правом в соответствии с действующим гражданским законодательством
        Российской Федерации. <br/>
        34. Авторское право на использование содержания Сайта принадлежит Компании. <br/>
        35. Компания предоставляет Посетителю и/или Пользователю неисключительную лицензию на использование содержания
        Сайта в пределах, установленных настоящим Пользовательским соглашением. <br/>
        36. Посетитель и/или Пользователь обязуется использовать Сайт только в законных целях и способами, не нарушающим
        права третьих лиц. <br/>
        37. Компания не несет ответственность за вред, причиненный технике Посетителя и/или Пользователя в случае, если
        это произошло в результате перехода по гипертекстуальным ссылкам, размещенным на Сайте. <br/>
        38. Полномочия Компании <br/>
        39. Компания оставляет за собой право без какого-либо специального уведомления вносить изменения в настоящее
        Пользовательское соглашение, в связи с чем Посетитель и/или Пользователь обязуется самостоятельно контролировать
        наличие изменений в настоящим Пользовательском соглашении. Новая редакция Пользовательского соглашения вступает
        в силу с момента ее размещения, если иное не предусмотрено новой редакцией Пользовательского соглашения.
        Действующая редакция Пользовательского соглашения находится на Сайте. <br/>
        40. Компания оставляет за собой право изменять Сайт, в том числе изменять или добавлять в его структуру разделы,
        менять дизайн и совершать прочие действия, направленные на повышение функциональности Сайта и удобства
        совершения заказа Товаров Пользователями и ознакомления Посетителя и/или Пользователя с информацией, размещенной
        Компанией на Сайте. <br/>
        41. Компания вправе произвести блокировку, исключение, удаление информации, размещенной Пользователем, без
        согласия последнего, если такая информация не отвечает требованиям действующего российского законодательства и
        положениям настоящего Пользовательского соглашения. <br/>
        42. Компания вправе произвести приостановление оказания услуг пользования Сайтом, либо отказать Пользователю в
        возможности использования отдельных ресурсов Сайта, либо отменить регистрацию учетной записи Пользователя, если
        у Компании есть основания полагать, что предоставленная Пользователем информация о своих персональных данных
        неверна (искажена, недостоверна). <br/>
        43. Компания вправе осуществить действия по удалению учетной записи Пользователя в случае систематического
        нарушения последним положений настоящего Пользовательского соглашения. <br/>
        44. Технологии, используемые Компанией на Сайте <br/>
        45. Компания вправе использовать технологию `cookie` для сохранения информации об ip-адресе Посетителей и
        Пользователей Сайта. `Cookie` не используются для сохранения конфиденциальной информации о Посетителях и
        Пользователях Сайта и не направлены на установление личности Посетителя и Пользователей Сайта. Вся информация,
        которая собирается и анализируется, анонимна. <br/>
        46. Использование технологии `cookie` представляет собой размещение на Сайте определенного набора символов
        (знаков), которые сохраняются на компьютере (далее - `устройство`, с которого был выполнен вход на Сайт)
        Посетителей и Пользователей Сайта, при доступе к определенным местам Сайта. <br/>
        47. Цели применения Компанией технологии `cookie`: <br/>
        48. аутентификация (распознавание) Посетителей и Пользователей при повторном входе на Сайт; <br/>
        49. аналитическая деятельность по исследованию предпочтений Посетителей и Пользователей Сайта; <br/>
        50. статистика по активности Посетителей и Пользователей на Сайте; <br/>
        51. обработка заказов Пользователей на Сайте; <br/>
        52. повышение производительности и эффективности Сайта; <br/>
        53. аналитика и исправление ошибок Сайта, улучшение работы всех ресурсов Сайта; <br/>
        54. безопасность и целостность ресурсов Сайта. <br/>
        55. Файлы `cookie` устанавливаются на устройство Посетителя или Пользователя в момент доступа к Сайту.
        Посетитель и Пользователь уведомляются об использовании Компанией технологии `cookie` посредством настоящего
        Пользовательского соглашения. Продолжение использования Посетителем и/или Пользователем сервисов Сайта будет
        расценено Компанией как согласие указанных лиц на использование в отношении их действий на Сайте технологии
        `cookie`. <br/>
        56. Файлы cookie, сохраняемые на устройстве Посетителя и/или Пользователя: <br/>
        57. Некоторые файлы `cookie` сохраняются на устройство Посетителя и/или Пользователя в момент входа на Сайт и
        сохраняются до конца данной конкретной сессии работы в браузере. при закрытии браузера эти файлы `cookie`
        становятся ненужными и автоматически удаляются. Такие файлы `cookie` называются `сеансовыми`. <br/>
        58. Некоторые файлы `cookie` сохраняются на устройстве Посетителя и/или Пользователя и в промежутке между
        сессиями работы в браузере - они не удаляются после закрытия браузера. Такие файлы `cookie` называются
        `постоянными`. Срок хранения постоянных файлов cookie на устройстве различается для разных файлов
        `cookie`. <br/>
        59. Компания использует постоянные файлы `cookie` в следующих целях: для статистики посещения Сайта, возврата на
        Сайт, статистики изменения предпочтений и характера использования сервисов Сайта, а также для оценки
        эффективности и производительности сервисов Сайта, аналитике ошибок сервисов Сайта. <br/>
        60. Посетители и Пользователи Сайта могут выразить свой отказ от применения технологии `cookie` путем внесения
        изменений в настройки используемого ими Интернет-браузера, позволяющих блокировать файлы `cookie` или
        предупреждать Посетителя и/или Пользователя, когда файлы данного типа будут отправлены на устройство, с которого
        был осуществлен вход на Сайт. Если для просмотра и доступа к Сайту Посетителем и/или Пользователем используются
        различные устройства (например, компьютер, смартфон, планшет и тому подобные устройства), то указанным лицам
        необходимо убедиться, что каждый Интернет-браузер на каждом устройстве настроен в соответствии с точкой зрения
        Посетителя и/или Пользователя на работу с файлами `cookie`. <br/>
        61. До тех пор, пока Посетитель и/или Пользователь своими действиями не выразит отказа от использования
        Компанией в отношении его действий на Сайте технологии `cookie`, данные файлы `cookie` будут сохраняться на
        устройство Посетителя и/или Пользователя, с которого был выполнен вход на Сайт. <br/>
        62. Компания имеет право передавать информацию об ip-адресах Посетителей и Пользователей Сайта своим партнерам и
        третьим лицам, имеющим заключенные с Компанией договоры, для исполнения обязательств перед Посетителем и
        Пользователем. <br/>
        63. Заключительные положения <br/>
        64. Настоящее Пользовательское соглашение регулируется нормами действующего российского законодательства. <br/>
        65. Настоящее Пользовательское соглашение распространяется на Посетителей и Пользователей. <br/>
        66. Все возможные споры относительно настоящего Пользовательского соглашения разрешаются согласно нормам
        действующего российского законодательства. <br/>
        67. Ввиду безвозмездности условий настоящего Пользовательского соглашения нормы о защите прав потребителей не
        могут быть применимыми к отношениям между Посетителей и/или Пользователем и Компанией. <br/>
        68. Ввиду предоставления Пользователями своих персональных данных при регистрации на Сайте, Компанией совершает
        действия, направленные на сбор, запись, хранение и систематизацию указанных данных физических лиц с соблюдением
        требований, предусмотренных Федеральным законом от 27.07.2006 N 152-ФЗ `О персональных данных`, и в соответствии
        с разработанной Компанией Политикой конфиденциальности.


      </p>
    </div>
  );
};

export default AgreementIndex;