import React from 'react';
import styles from './rule.module.css'
const PolicyIndex = () => {
  return (
    <div className={styles.container}>
      <h2 style={{textAlign: "center", padding: 20}}>Политика конфиденциальности</h2>
      <p>
        1. Общие положения <br/>
        2. Настоящая Политика конфиденциальности (далее — "Политика") действует в отношениях между Пользователями и
        Pomodoro.<br/>
        3. В рамках настоящей Политики под "персональной информацией Пользователя" понимаются:<br/>
        4. персональные данные, которые Пользователь предоставляет о себе (фамилию, имя, отчество; дата рождения; адрес
        доставки; номер телефона; адрес электронной почты и иные сведения) во время использования им сайта, сервисов,
        служб и программ Компании (далее — "Сервисы");<br/>
        5. копия паспорта или иного документа, удостоверяющего личность клиента.<br/>
        6. Компания не проверяет достоверность персональной информации, предоставляемой Пользователями. Однако Компания
        исходит из того, что Пользователь предоставляет достоверную и достаточную персональную информацию, и
        поддерживает эту информацию в актуальном состоянии.<br/>
        7. Компания может осуществлять аудиозапись телефонного разговора с Пользователем, независимо от получения и/или
        неполучения от Пользователя согласия на аудиозапись телефонного разговора, если указанные действия необходимы
        Компании для исполнения своих обязательств, оценки качества используемых Сервисов и оказанных Пользователю
        услуг, а также для достижения целей обработки персональных данных, перечисленных в пункте 2.1. настоящей
        Политики.<br/>
        8. Не могут быть отнесены к персональным данным Пользователя такие данные, как: номер телефона и адрес
        электронной почты, если обработка этих данных осуществляется обезличенно, то есть без привязки к персональным
        данным конкретного Пользователя, его истории заказов товаров Компании.<br/>
        9. Данные, которые автоматически передаются Сервисам в процессе их использования с помощью установленного на
        устройстве Пользователя программного обеспечения, в том числе ip-адрес, информация из cookie, информация о
        браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к Сервисам), время доступа,
        адрес запрашиваемой страницы не являются персональными данными.<br/>
        10. Настоящая Политика применима только к Сервисам Компании. Компания не контролирует и не несет ответственность
        за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайтах Компании. На таких
        сайтах у Пользователя может собираться или запрашиваться иная персональная информация, а также могут совершаться
        иные действия.<br/>
        11. Под обработкой персональных данных в настоящей Политике понимается: сбор вышеуказанных данных, их
        систематизация, накопление, хранение, уточнение (обновление, изменение), использование, блокирование,
        уничтожение.<br/>
        12. Цели сбора и обработки персональной информации Пользователей<br/>
        13. Персональную информацию Пользователя Компания может обрабатываться в следующих целях:<br/>
        14. идентификация Пользователя при исполнении Публичной оферты о продаже товаров дистанционным способом и
        договоров с Компанией;<br/>
        15. направление кассового чека в электронном виде на адрес электронной почты и/или телефон Пользователя;<br/>
        16. предоставление Пользователю персонализированных Сервисов;<br/>
        17. связь с Пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования
        Сервисов, оказания услуг по заказу и доставке товаров Компании, а также обработка запросов и заявок от
        Пользователя;<br/>
        18. улучшение качества Сервисов, удобства их использования, разработка новых Сервисов и услуг;<br/>
        19. рекламы своих товаров и услуг;<br/>
        20. проведение статистических и иных исследований на основе предоставленных данных;<br/>
        21. иных целях, не противоречащих действующему законодательству РФ.<br/>
        22. Условия обработки персональной информации Пользователя и её передачи третьим лицам<br/>
        23. Использование Сервисов означает согласие Пользователя с Политикой. В случае несогласия с этими условиями
        Пользователь должен воздержаться от использования Сервисов.<br/>
        24. Согласие Пользователя на предоставление Персональной информации, данное им в соответствии с настоящей
        Политикой в рамках отношений с одним из лиц, входящих в Компанию, распространяется на все лица, входящие в
        Компанию.<br/>
        25. Согласие Пользователя на обработку его персональных данных действует со дня начала пользования Сервисов до
        дня отзыва согласия, посредством обращения Пользователя к представителям Компании (операторам) по телефону,
        указанном на сайте pomodoro.moba.market, либо посредством направления Пользователем письма по электронной почте
        на адрес info@pizzapomodoro.ru.<br/>
        26. Пользователь вправе запросить перечень своих персональных данных и/или потребовать изменить, уничтожить свои
        персональные данные, позвонив по по телефону, указанном на сайте pomodoro.moba.market, либо посредством
        направления Пользователем письма по электронной почте на адрес info@pizzapomodoro.ru и указав свои имя,
        отчество, фамилию, дату рождения, адрес доставки, телефон и адрес электронной почты.<br/>
        27. Обработка таких персональных данных, как: фамилия, имя, отчество; дата рождения; адрес доставки, телефон,
        адрес электронной почты может осуществляться оператором Компании независимо от получения и/или неполучения от
        Пользователя согласия на их обработку, если указанные персональные данные необходимы Компании для выполнения
        заказа и доставки товаров Пользователю и оценки качества оказанных услуг.<br/>
        28. Компания хранит персональную информацию Пользователей, обеспечивая их конфиденциальность и защиту от
        неправомерного или случайного доступа к ним третьих лиц.<br/>
        29. Компания вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:<br/>
        30. передача необходима в рамках использования Пользователем определенного Сервиса, либо для оказания услуги
        Пользователю;<br/>
        31. такая передача происходит в рамках продажи или иной передачи бизнеса (полностью или в части), при этом к
        приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им
        персональной информации;<br/>
        32. в целях обеспечения возможности защиты прав и законных интересов Компании или третьих лиц в случаях, когда
        Пользователь нарушает условия Публичной оферты;<br/>
        33. в целях доставки товаров Пользователю посредством курьерской службы Компании;<br/>
        34. в целях сохранения и проведения анализа истории заказов товаров Пользователем посредством использования
        операторов Компании, осуществляющих прием заказов товаров по телефону;<br/>
        35. в целях совершения операторами Компании и иными уполномоченными представителями Компании исходящих опросов и
        вызовов в адрес Пользователя в целях проведения качественного и количественного анализа предоставляемого Сервиса
        и оказанных услуг, исследования предпочтений Пользователя, проведения маркетинговых исследований, проведение
        розыгрышей призов среди Пользователей, оценки удовлетворенности Пользователя Сервисами и услугами Компании,
        урегулирования конфликтных ситуаций.<br/>
        36. Компания имеет право назначить лицо (оператора Компании), ответственное за организацию обработки
        персональных данных Пользователей, в целях реализации положений настоящей Политики.<br/>
        37. Компания вправе самостоятельно определять используемые способы обработки персональных данных Пользователей
        (включая, но, не ограничиваясь: автоматическая сверка почтовых кодов с базой кодов/индексов, автоматическая
        проверка написания названий улиц/населенных пунктов, сегментация базы данных по заданным критериям).<br/>
        38. Меры, применяемые для защиты персональной информации Пользователей<br/>
        39. Компания принимает необходимые и достаточные организационные и технические меры для защиты персональной
        информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования,
        копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.<br/>
        40. Компания обеспечивает конфиденциальность предоставленных Пользователем персональных данных, их защиту от
        копирования, распространения.<br/>
        41. Компания обязуется предотвращать попытки несанкционированного доступа к персональным данным Пользователей,
        предоставленных Компании; своевременно обнаруживать и пресекать такие попытки.<br/>
        42. Компания устанавливает следующие организационные меры для защиты Персональной информации:<br/>
        43. организация режима обеспечения безопасности помещений, в которых размещено оборудование (серверы) для
        обработки и хранения персональных данных Пользователей в информационной системе персональных данных,
        препятствующего возможности неконтролируемого проникновения и пребывания в помещениях лиц, не имеющих прав
        доступ в эти помещения;<br/>
        44. обеспечение сохранности носителей персональных данных;<br/>
        45. утверждение перечня лиц, имеющих право доступа к персональным данным Пользователей в рамках выполнения своих
        служебных обязанностей;<br/>
        46. назначение приказом должностных лиц, ответственных за обеспечение безопасности персональных данных
        Пользователей в информационной системе персональных данных;<br/>
        47. использование средств защиты информации, прошедших процедуру оценки соответствия требованиям
        законодательства Российской Федерации (сертификация) в области обеспечения безопасности информации, в случае,
        когда применение таких средств необходимо для нейтрализации актуальных угроз;<br/>
        48. установление правил доступа к персональным данным, обрабатываемым в информационной системе персональных
        данных, а также обеспечением регистрации и учета всех действий, совершаемых с персональными данными
        Пользователей в информационной системе персональных данных;<br/>
        49. проведение профилактической работы с операторами Компании по предупреждению разглашения ими персональных
        данных Пользователей;<br/>
        50. ознакомление операторов Компании с действующими нормативами в области защиты персональных данных и
        локальными актами;<br/>
        51. проведение систематических проверок соответствующих знаний операторов Компании, обрабатывающих персональные
        данные Пользователей, и соблюдения ими требований нормативных документов по защите конфиденциальных
        сведений;<br/>
        52. обеспечение контроля за принимаемыми мерами по обеспечению безопасности персональных данных Пользователей и
        уровня защищенности информационных систем персональных данных.<br/>
        53. Изменение Политики конфиденциальности<br/>
        54. Компания имеет право вносить изменения в настоящую Политику. При внесении изменений в актуальной редакции
        указывается дата последнего обновления. Пользователь обязуется самостоятельно контролировать наличие изменений в
        настоящей Политике. Новая редакция Политики вступает в силу с момента ее размещения, если иное не предусмотрено
        новой редакцией Политики. Действующая редакция всегда находится на Сайте.<br/>
        55. Заключительные положения<br/>
        56. Настоящая Политика регулируется нормами действующего законодательства РФ.<br/>
        57. Все возможные споры относительно настоящей Политики разрешаются согласно нормам действующего
        законодательства РФ.


      </p>
    </div>
  );
};

export default PolicyIndex;